//++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
//++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
#ifndef _BSP_DAC_H
#define _BSP_DAC_H
//----------------------------------------------------------------------------------
#ifndef  Data_Retyped
    #include ".\DataTypedef.h"
#endif
#include<stdint.h>
#include<stdio.h>
#include<stdbool.h>
//-----------------------------------------------------------------------------------
//Function
//名称: adc管脚配置
//功能: 配置IO管脚、定时器
//入口: 无
//出口: 无
void bsp_dac_cfg(void);
//Task
//名称: 端口DAC1设置输出电压值
//功能: 设置0-10V输出
//入口: in_dacValue  范围0-100   
//出口: 
void bsp_dac1_output(uint8_t value);
//Task
//名称: 端口DAC1设置输出电压值
//功能: 设置0-10V输出
//入口: in_dacValue  范围0-100   
//出口: 
void bsp_dac2_output(uint8_t value);

//-----------------------------------------------------------------------------------
#endif