
/*******************************************************************************
*
*	模块名称 : 看门狗模块
*	文件名称 : MOD_WDG.c
*	版    本 : V1.0
*	说    明 :   
*	修改记录 :
*		版本号  日期        作者     说明
*		V1.0   2018-12-25  osman.li  正式发布
*	Copyright (C), 2018-2022,   menredGroup
*       编译环境 ：IAR FOR ARM V7.4.3.8938       
*******************************************************************************/


//++++++++++++++++++++++++++++++start+++++++++++++++++++++++++++++++++++++++++++
#include ".\depend\bsp_watchDog.h"
//------------------------------------------------------------------------------
//Init
//名称: 配置
//功能: 在配置CLK之前调用。
//入口: 无
//
//出口: 无
void mde_IWDG_Configure(void)
{
	#ifdef NDEBUG
	BSP_IWDG_Configure( );
	#endif
}

//--------------------------------END-------------------------------------------


//------------------------------------------------------------------------------
//Task
//名称: 喂狗
//功能: 配置独立看门狗，必须在CLK之前配置。
//入口: 无
//
//出口: 无
void mde_IWDG_FeedDog(void)
{
	#ifdef NDEBUG
	BSP_IWDG_FeedDog();
	#endif
}
//-----------------------MOD_ADC_NTC.c--END------------------------------------