#ifndef __BSP_SWITCHIN_H__
#define __BSP_SWITCHIN_H__
/*============================ INCLUDES ======================================*/
#include <stdint.h>
#include <stdbool.h>
/*============================ MACROS ========================================*/
/*============================ MACROFIED FUNCTIONS ===========================*/
/*============================ TYPES =========================================*/ 
/*============================ GLOBAL VARIABLES ==============================*/
/*============================ LOCAL VARIABLES ===============================*/
/*============================ PROTOTYPES ====================================*/
//++++++++++++++++++++++++++++++start+++++++++++++++++++++++++++++++++++++++++++
//name:数字开关配置
void bsp_switch_in_config(void);
//name:获取数字开关1状态
bool BSP_switch1_pull_statsu(void);
//name:获取数字开关2状态
bool BSP_switch2_pull_statsu(void);
//name:获取数字开关3状态
bool BSP_switch3_pull_statsu(void);
//name:获取数字开关4状态
bool BSP_switch4_pull_statsu(void);
//++++++++++++++++++++++++++++++start+++++++++++++++++++++++++++++++++++++++++++

#endif
/* EOF */
//-----------------------BSP_systemTick.h--END------------------------------------