//++++++++++++++++++++++++++++++start+++++++++++++++++++++++++++++++++++++++++++
#ifndef _MOD_LED_H
#define _MOD_LED_H
//------------------------------E N D-------------------------------------------
//++++++++++++++++++++++++++++++start+++++++++++++++++++++++++++++++++++++++++++
#include <stdint.h>
#include <stdbool.h>
//------------------------------E N D-------------------------------------------
typedef enum
{
    LED_1  = (uint8_t)0,    //4路通道指示灯
    LED_2,              
    LED_3,
    LED_4,
}led_type_t;
//++++++++++++++++++++++++++++++start+++++++++++++++++++++++++++++++++++++++++++
//Function
//名称: 指示灯开启
//功能: 开启指定类型指示灯
//入口: _in_ledType  指示灯类型，枚举，共4路 <<-------------------------传入
//出口: 无
void mde_led_on(uint8_t in_solidNum);

//++++++++++++++++++++++++++++++start+++++++++++++++++++++++++++++++++++++++++++
//Function
//名称: 指示灯关闭
//功能: 关闭指定类型指示灯
//入口: _in_ledType  指示灯类型，枚举，共4路 <<-------------------------传入
//出口: 无
void mde_led_off(uint8_t in_solidNum);

//++++++++++++++++++++++++++++++start+++++++++++++++++++++++++++++++++++++++++++
//Function
//名称: 指示灯闪烁
//功能: 闪动指定类型指示灯
//入口: _in_ledType  指示灯类型，枚举，共4路       <<-------------------------传入
//入口: _in_100msOnDelay  指示灯亮时间，单位100ms  <<-------------------------传入
//入口:_in_100msOffDelay 指示灯灭时间，单位100ms   <<-------------------------传入
//出口: 无
void mde_led_blink(uint8_t in_solidNum,uint16_t _in_100msOnDelay,uint16_t _in_100msOffDelay);

//++++++++++++++++++++++++++++++start+++++++++++++++++++++++++++++++++++++++++++
//Function
//名称: 指示灯扫描任务
//功能: 定时扫描，确定指示灯的状态
//入口: _in_msTick 扫描周期，毫秒级 <<-----------------------------------传入
//出口: 无
void mde_led_task(void);
#endif
//-----------------------Mod_LED.h--END-----------------------------------
